// 🍕 Я новичок в программировании и теперь хочу получить сумму двух массивов... вернее, сумму всех их элементов. Буду благодарен за помощь.

// 🍕 P.S. Каждый массив содержит только целые числа. На выходе тоже число.

// ❗❗ arrayPlusArray([1, 2, 3], [4, 5, 6]), 21);

// ❗❗ arrayPlusArray([-1, -2, -3], [-4, -5, -6]), -21);

// ❗❗ arrayPlusArray([0, 0, 0], [4, 5, 6]), 15);

// ❗❗ arrayPlusArray([100, 200, 300], [400, 500, 600]), 2100);

function arrayPlusArray(arr1, arr2) {
    let i = 0;
    while (i < arr1.length) {
        arr2.push(arr1[i]);
        i++;
    }

    let sum = 0;

    for (let i = 0; i < arr2.length; i++) {
        sum += arr2[i];
    }
    return sum;
}

console.log(arrayPlusArray([1, 2, 3], [4, 5, 6]));
