// 🍕 Рассмотрим массив/список овец, в котором некоторые овцы могут отсутствовать на своих местах.
// 🍕 Нам нужна функция, которая подсчитывает количество овец, присутствующих в массиве (true означает присутствие)

// ❗❗ Например,

const array = [
    true,
    true,
    true,
    false,
    true,
    true,
    true,
    true,
    true,
    false,
    true,
    false,
    true,
    false,
    false,
    true,
    true,
    true,
    true,
    true,
    false,
    false,
    true,
    true,
];

// ❗❗  Правильный ответ будет 17.

// ❗❗ Подсказка: Не забудьте проверить наличие некорректных значений, таких как null/.undefined

function countSheeps(sheep) {
    let caunter = 0;
    for (let i = 0; i < sheep.length; i++) {
        if (sheep[i] === true) {
            caunter += 1;
        }
    }

    return caunter;
}

console.log(countSheeps(array));
