// 🍕 Дан массив целых чисел в виде строк и чисел. Вернуть сумму значений массива, как если бы все они были числами.

// Ответ дайте в виде числа.

// ❗❗    assert.strictEqual(sumMix([9, 3, '7', '3']), 22);

// ❗❗    assert.strictEqual(sumMix(['5', '0', 9, 3, 2, 1, '9', 6, 7]), 42);

// ❗❗    assert.strictEqual(sumMix(['3', 6, 6, 0, '5', 8, 5, '6', 2,'0']), 41);

function sumMix(array) {
    let sum = 0;
    for (let i = 0; i < array.length; i++) {
        sum += array[i] / 1;
    }
    return sum;
}

console.log(sumMix([9, 3, "7", "3"]));
